<template>
  <div class="hello">
    这是一个组件，但我暂不需要
            <!-- <div>
                第一章，自我介绍
                第二章，我在广清
                第三章，未来的我
                第四章，最后感言
            </div>
            <div>
                第一章
                各位领导、同事们大家好，我叫郭子安，于2020年5月21日正式入职防控中心，担任前端开发工程师。
            </div>
            <div>
                第二章
                在短暂的两个月里面，我在防控中心总共接触了5个项目，
                一个是PC端的官网改造，持续时间大概是两周，根据需求改造成想要的效果，并根据大概的效果提出了一些改进方式。
                并做出了手机端官网的功能，在整个改造官网的过程中，还修复了三个以前遗留的问题。
                一个是高层次人才申报系统的样式优化，持续了一个星期，从这样到那样。
                一个是监测预警平台的功能修改，持续时间大概在两个星期，主要的修改在企业详情这方面，在修复的过程中发现了几个兼容性的问题，并进行了修复。其中风险详情功能代码量也从4百多行代码减少到2百行代码
                一个是金鹰防控一体化APP的改造，我参与了一个后台开发的功能，时间持续5天左右，开发了两个页面，一个是机构管理，一个是字典管理。其中字典管理页从无到有仅需一天时间便快速开发完成。
                采用了前后分离的方式，我当时搭档的是天杰，后端无需关心前端页面交互和样式问题，专心做后端接口，我做前端页面，各自做相互的工作，对接一天即可成型，达到了快速开发的效果。
                最后一个就是现在对接开发的金服中心供应链金融纠纷在线多元化解平台，从需求雏形开始我就参与到里面，也十分感谢领导的帮助下，我开始去学习梳理需求和绘制原型图，这段期间比较大的改版总共是3版，到目前为止画了54个原型页面出来，力求尽量做到最好，让需求方满意。
            </div>
            <div>
                第三章
                未来的话，我会更加专注于系统的前端性能以及用户交互体验方面。
                在我参与的项目里面我期待能做出更好用户体验，更快的交互性能，更流畅的动画，让用户能感受到防控中心的专业和先进。
                这段时间在开发的过程中，特别是以前直接采购的项目，前端方面我能看到有很多能改进的空间，未来的话我尽力去把前端方面变得更加的友好，前后端开发流程更加的顺畅，为公司效益增长更添一点力。
                现今的我虽然基本了解公司运营的大概业务和平台，但自我感觉尚有不足，期待以后能更多的接触公司的项目和业务。
                我也承诺，无论试用期还是未来，我都依然尽力做好领导安排的每一件工作，希望能得到各方的满意。
                另外，未来的话我希望能推进前后端分离，从金服中心多元化解平台开始，进行前后分离的方式，让后端同事专心于数据和接口，让前端关注交互和流程。也因为有过先例项目，未来我会推进使用更为新颖的前端技术，让前后端彻底分离，逐渐累积前端的组件库，加厚公司的前端技术积累，对用户更友好，对开发更省事，更便于上手即用，增长公司收益。
                期望能扎根于金融风险防控方面，为公司走向市场化业务出一份力，为金融风险监测防控事业作出更大的贡献。
            </div>
            <div>
                第四章
                首先十分感谢领导们，让我站上了这个舞台。也十分感谢这段时间和我共事的一堆同事，刚进来的时候，很多环境的搭建、账号的创建都是领导和同事帮助下所配好的。
                也感谢行政人事部这段时间对我关于工作制度方面的疑问的解答。
                时间过得飞快，不知不觉中已加入了防控中心两个月了，在这段时间里面，当我遇上困难，领导和同事都会细心地指导我。从每个月的读书分享会、每周的下午茶、每天的晨会，能感受到领导对员工的关怀还有公司的朝气蓬勃的氛围。
                再次感谢领导和同事百忙之中抽出时间去听我的述职报告。
                最后我想说的是，面对上级安排的每一份工作，我能做的就是将勤补挫和尽力做好。
                谢谢诸位。
            </div> -->
  </div>
</template>

<script>
export default {
  name: 'HelloWorld',
  props: {
    msg: String
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="less">
h3 {
  margin: 40px 0 0;
  color: red;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
</style>
